{"_id":{"$oid":"59fcfa66ebf16e21384c8d58"},"title":"Trump is F*cking Crazy","author":"Olbermann, Keith","format":"hardcover","fiction":false,"read":false,"pages":423,"subject":"Political","description":"This book contains the text of the Keith Olbermann commentaries on Donald Trump.","year":2017}
{"_id":{"$oid":"59fd0029b88384350c55f0de"},"title":"How to Write Science Fiction and Fantasy","author":"Card, Orson Scott","format":"hardcover","fiction":false,"read":true,"pages":140,"subject":"Writing","description":"Writing tips for Science Fiction and Fantasy.","year":1990}
{"_id":{"$oid":"5a034a6ab1b8e4219801b9ab"},"title":"Now Write! Science Fiction, Fantasy, and Horror","author":"Lamson, Laurie","format":"paperback","fiction":false,"read":true,"pages":367,"subject":"writing","description":"Writing tips for Science Fiction, Fantasy, and Horror.","year":2014}
{"_id":{"$oid":"5a3fa5c17f59d71f9cf18275"},"title":"Princess Bride, The","author":"Goldman, William","format":"hardcover","fiction":true,"read":true,"pages":392,"genre":"Fantasy","description":"Special edition of The Princess Bride with illustrations.","year":1973}
{"_id":{"$oid":"5a573ede781258198cc52c0b"},"title":"Ritual Bath, The","author":"Kellerman, Faye","format":"paperback","fiction":true,"read":false,"pages":358,"genre":"Mystery","description":"Detective Peter Decker of the LAPD is stunned when he gets the report. Someone has shattered the sanctuary of a remote yeshiva community in the California hills with an unimaginable crime. One of the women was brutally raped as she returned from the mikvah, the bathhouse where the cleansing ritual is performed.  The crime was called in by Rina Lazarus, and Decker is relieved to discover that she is a calm and intelligent witness. She is also the only one in the sheltered community willing to speak of this unspeakable violation. As Rina tries to steer Decker through the maze of religious laws, the two grow closer. But before they get to the bottom of this horrendous crime, revelations come to light that are so shocking, they threaten to come between the hard-nosed cop and the deeply religious woman with whom he has become irrevocably linked.","year":2011}
{"_id":{"$oid":"5a574152781258198cc52c0d"},"title":"Sleeping Beauty Killer, The","author":["Clark, Mary Higgins","Burke, Alafair"],"format":"paperback","fiction":true,"read":false,"pages":354,"genre":"Mystery","description":"Fifteen years after being convicted of murdering her fiancé—the famed philanthropist Hunter Raleigh III—Casey Carter is determined to clear her name. Though she has served her time, she finds that she is still living under suspicion. Going on the true crime show Under Suspicion seems to be her only hope to prove her innocence.  The show’s producer, Laurie Moran, also believes in her innocence and wants to help Casey. But with Alex Buckley taking a break from the show—cooling his potential romance with Laurie—Under Suspicion introduces a new on-air host in Ryan Nichols, a hot shot legal whiz with a Harvard Law degree, a Supreme Court clerkship, experience as a federal prosecutor. Ryan has no problems with steering the show, and even tries to stop Laurie from taking on Casey’s case because he’s so certain she’s guilty.  An egomaniacal new boss, a relentless gossip columnist, and Casey’s longstanding bad reputation: Laurie must face this and more to do what she believes is right, to once and for all prove Casey’s innocence—that is, if she’s innocent.","year":2016}
{"_id":{"$oid":"5a6cd3e7de582a57049b34e2"},"title":"Alienist, The","author":"Carr, Caleb","format":"paperback","fiction":true,"read":false,"pages":512,"genre":["Mystery","Thriller","Suspense"],"description":"The year is 1896. The city is New York. Newspaper reporter John Schuyler Moore is summoned by his friend Dr. Laszlo Kreizler—a psychologist, or “alienist”—to view the horribly mutilated body of an adolescent boy abandoned on the unfinished Williamsburg Bridge. From there the two embark on a revolutionary effort in criminology: creating a psychological profile of the perpetrator based on the details of his crimes. Their dangerous quest takes them into the tortured past and twisted mind of a murderer who will kill again before their hunt is over.  Fast-paced and riveting, infused with historical detail, The Alienist conjures up Gilded Age New York, with its tenements and mansions, corrupt cops and flamboyant gangsters, shining opera houses and seamy gin mills. It is an age in which questioning society’s belief that all killers are born, not made, could have unexpected and fatal consequences.","year":1994}
{"_id":{"$oid":"5a7340d9cca261483c772514"},"title":"Night Circus, The","author":"Morgenstern, Erin","format":"paperback","fiction":true,"read":false,"pages":512,"genre":["Historical","Fantasy","Coming of Age"],"description":"The circus arrives without warning. No announcements precede it. It is simply there, when yesterday it was not. Within the black-and-white striped canvas tents is an utterly unique experience full of breathtaking amazements. It is called Le Cirque des Rêves, and it is only open at night.  But behind the scenes, a fierce competition is underway: a duel between two young magicians, Celia and Marco, who have been trained since childhood expressly for this purpose by their mercurial instructors. Unbeknownst to them both, this is a game in which only one can be left standing. Despite the high stakes, Celia and Marco soon tumble headfirst into love, setting off a domino effect of dangerous consequences, and leaving the lives of everyone, from the performers to the patrons, hanging in the balance.","year":2012}
{"_id":{"$oid":"5a739a7fd6c8e1465401edb2"},"title":"Learning the bash Shell","edition":"3rd Edition","author":"Newham, Cameron","format":"paperback","fiction":"false","read":"true","pages":"312","subject":"Programming","description":"An introduction to bash and bash scripting.","year":"2005"}
{"_id":{"$oid":"5a739c47d6c8e1465401edb3"},"title":"Git in Practice","author":"McQuaid, Mike","format":"paperback","fiction":false,"read":true,"pages":237,"subject":"Programming","description":"Using Git source control.","year":2014}
{"_id":{"$oid":"5a73a010d6c8e1465401edb5"},"title":"Sleeping Beauties: A Novel","author":["King, Stephen","King, Owen"],"format":"hardcover","fiction":true,"read":false,"pages":699,"genre":["Mystery","Horror","Supernatural","Suspense","Thriller"],"description":"In a future so real and near it might be now, something happens when women go to sleep: they become shrouded in a cocoon-like gauze. If they are awakened, if the gauze wrapping their bodies is disturbed or violated, the women become feral and spectacularly violent. And while they sleep they go to another place, a better place, where harmony prevails and conflict is rare.  One woman, the mysterious “Eve Black,” is immune to the blessing or curse of the sleeping disease. Is Eve a medical anomaly to be studied? Or is she a demon who must be slain? Abandoned, left to their increasingly primal urges, the men divide into warring factions, some wanting to kill Eve, some to save her. Others exploit the chaos to wreak their own vengeance on new enemies. All turn to violence in a suddenly all-male world.  Set in a small Appalachian town whose primary employer is a women’s prison, Sleeping Beauties is a wildly provocative, gloriously dramatic father-son collaboration that feels particularly urgent and relevant today.","year":2017}
{"_id":{"$oid":"5a79c0d1fc72ea1e003df564"},"title":"bash Cookbook","author":["Albing, Carl","Vossen, JP","Newham, Cameron"],"format":"paperback","fiction":false,"read":true,"pages":565,"subject":"Programming","description":"Complete bash scripting examples for commong tasks.","year":2007}
{"_id":{"$oid":"5a79c23cfc72ea1e003df565"},"title":"Classic Shell Scripting","author":["Robbins, Arnold","Beebe, Nelson H.F."],"format":"paperback","fiction":false,"read":true,"pages":508,"subject":"Programming","description":"An introduction to programming the bash Shell.","year":2005}
{"_id":{"$oid":"5a79c6f90263264acca86d5c"},"title":"HTML5 \u0026 CSS3 for the Real World","author":["Goldstein, Alexis","Lazaris, Louis","Weyl, Estelle"],"format":"paperback","fiction":false,"read":true,"pages":327,"subject":["Web Design","Programming","HTML5","CSS3"],"description":"Using HTML5 and CSS3 for web design, including information about animations, web forms, and APIs","year":2011}
{"_id":{"$oid":"5a79c82a0263264acca86d5d"},"title":"C# Player's Guide, The","edition":"2nd Edition","author":"Whitaker, RB","format":"paperback","fiction":false,"read":true,"pages":338,"subject":["Programming","C# 6.0","Visual Studio 2015",".NET 4.6"],"description":"Introduction to C# and Visual Studio. Worth reading because it talks about the new features of C# 6.0","year":2015}
{"_id":{"$oid":"5a7b9cfa12c5a34acc341617"},"title":"It","author":"King, Stephen","format":"paperback","fiction":true,"read":true,"pages":1184,"genre":"Horror","description":"They were seven teenagers when they first stumbled upon the horror. Now they are grown-up men and women who have gone out into the big world to gain success and happiness. But the promise they made twenty-eight years ago calls them reunite in the same place where, as teenagers, they battled an evil creature that preyed on the city’s children. Now, children are being murdered again and their repressed memories of that terrifying summer return as they prepare to once again battle the monster lurking in Derry’s sewers.","year":"1986"}
{"_id":{"$oid":"5a7be26bc3d42f35a85aae73"},"title":"Scythe","author":"Shusterman, Neal","format":"paperback","fiction":true,"read":false,"pages":435,"genre":["Action","Adventure","Dystopian","Science Fiction"],"description":"Two teens must learn the “art of killing” in this Printz Honor–winning book, the first in a chilling new series from Neal Shusterman, author of the New York Times bestselling Unwind dystology.  A world with no hunger, no disease, no war, no misery: humanity has conquered all those things, and has even conquered death. Now Scythes are the only ones who can end life—and they are commanded to do so, in order to keep the size of the population under control.  Citra and Rowan are chosen to apprentice to a scythe—a role that neither wants. These teens must master the “art” of taking life, knowing that the consequence of failure could mean losing their own.","year":2017}
{"_id":{"$oid":"5a7be3d1c3d42f35a85aae74"},"title":"Do Androids Dream of Electric Sheep?","author":"Dick, Philip K.","format":"paperback","fiction":true,"read":true,"pages":224,"genre":["Cyberpunk","Science Fiction"],"description":"THE INSPIRATION FOR BLADERUNNER. . . Do Androids Dream of Electric Sheep? was published in 1968. Grim and foreboding, even today it is a masterpiece ahead of its time. By 2021, the World War had killed millions, driving entire species into extinction and sending mankind off-planet. Those who remained coveted any living creature, and for people who couldn't afford one, companies built incredibly realistic simulacrae: horses, birds, cats, sheep. . . They even built humans. Emigrees to Mars received androids so sophisticated it was impossible to tell them from true men or women. Fearful of the havoc these artificial humans could wreak, the government banned them from Earth. But when androids didn't want to be identified, they just blended in. Rick Deckard was an officially sanctioned bounty hunter whose job was to find rogue androids, and to retire them. But cornered, androids tended to fight back, with deadly results.","year":1968}
{"_id":{"$oid":"5a7ced1e633cc03b6481f2ad"},"series":"Miss Peregrine's Peculiar Children","title":"Miss Peregrine's Home for Peculiar Children","author":"Riggs, Ransom","format":"paperback","fiction":true,"read":false,"pages":382,"genre":["Fantasy","Supernatural"],"description":"A mysterious island. An abandoned orphanage. And a strange collection of very curious photographs. It all waits to be discovered in \"Miss Peregrine's Home for Peculiar Children\", an unforgettable novel that mixes fiction and photography in a thrilling reading experience. As our story opens, a horrific family tragedy sets sixteen-year-old Jacob journeying to a remote island off the coast of Wales, where he discovers the crumbling ruins of Miss Peregrine's Home for Peculiar Children. As Jacob explores its abandoned bedrooms and hallways, it becomes clear that the children who once lived here - one of whom was his own grandfather - were more than just peculiar. They may have been dangerous. They may have been quarantined on a desolate island for good reason. And somehow - impossible though it seems - they may still be alive. A spine-tingling fantasy illustrated with haunting vintage photography, \"Miss Peregrine's Home for Peculiar Children\" will delight adults, teens, and anyone who relishes an adventure in the shadows. ","year":2011}
{"_id":{"$oid":"5a7cef13633cc03b6481f2ae"},"series":"Miss Peregrine's Peculiar Children","title":"Hollow City","author":"Riggs, Ransom","format":"paperback","fiction":true,"read":false,"pages":416,"genre":["Fantasy","Supernatural"],"description":"Like its predecessor, this second novel in the Peculiar Children series blends thrilling fantasy with vintage photography to create a one-of-a-kind reading experience.  September 3, 1940. Ten peculiar children flee an army of deadly monsters. And only one person can help them—but she’s trapped in the body of a bird. The extraordinary journey that began in Miss Peregrine’s Home for Peculiar Children continues as Jacob Portman and his newfound friends journey to London, the peculiar capital of the world. There, they hope to find a cure for their beloved headmistress, Miss Peregrine. But in this war-torn city, hideous surprises lurk around every corner. And before Jacob can deliver the peculiar children to safety, he must make an important decision about his love for Emma Bloom.","year":2014}
{"_id":{"$oid":"5a7cefd2633cc03b6481f2af"},"series":"Miss Peregrine's Peculiar Children","title":"Library of Souls","author":"Riggs, Ransom","format":"paperback","fiction":true,"read":false,"pages":464,"genre":["Fantasy","Supernatural"],"description":"The adventure that began with Miss Peregrine’s Home for Peculiar Children and continued in Hollow City comes to a thrilling conclusion with Library of Souls. As the story opens, sixteen-year-old Jacob discovers a powerful new ability, and soon he’s diving through history to rescue his peculiar companions from a heavily guarded fortress. Accompanying Jacob on his journey are Emma Bloom, a girl with fire at her fingertips, and Addison MacHenry, a dog with a nose for sniffing out lost children.   They’ll travel from modern-day London to the labyrinthine alleys of Devil’s Acre, the most wretched slum in all of Victorian England. It’s a place where the fate of peculiar children everywhere will be decided ","year":2015}
{"_id":{"$oid":"5a7e12a7ccb7970ba4f0e068"},"series":"Books of Bayern, The","title":"Forest Born","author":"Hale, Shannon","format":"paperback","fiction":true,"read":false,"pages":389,"genre":"Fantasy","description":"Ever since her brother introduced her to the trees, Rin has turned to them for peace or reassurance, even direction--that is, until the day they seemed to reject her. Rin is sure something is wrong with her, something that is keeping her from feeling at home in the Forest, from trusting herself with anyone at all. Determined to find a new sense of self, Rin accompanies Razo into the city, where she discovers that a mysterious threat haunts Bayern. She then joins three magical girls, Isi, Enna, and Dasha, as they venture toward the kingdom of Kel... where someone wants them dead.","year":2009}
{"_id":{"$oid":"5a7e170dccb7970ba4f0e069"},"series":"Books of Bayern, The","title":"River Secrets","author":"Hale, Shannon","format":"paperback","fiction":true,"read":false,"pages":290,"genre":"Fantasy","description":"Razo has never considered himself anything but ordinary; and certainly not a great soldier. So he's sure that his captain asks him to join an elite mission escorting the ambassador into Tira, Bayern's greatest enemy. But when the Bayern arrive i the strange southern country, it's Razo who discovers the first dead body. He is also the only Bayern able to befriend the ever-increasing murders, like the beautiful Lady Dasha. If Razo can embrace his talents, he might be the only one who can get the Bayern soldiers home alive.","year":2006}
{"_id":{"$oid":"5a7e1725ccb7970ba4f0e06a"},"title":"Stolen Child, The","author":"Carey, Lisa","format":"paperback","fiction":true,"read":false,"pages":370,"genre":["Historical","Literary","Magical Realism"],"description":"A haunting luminous novel set on an enchanted island off the west coast of Ireland where magic faith and superstition pervade the inhabitants lives and tangled relationships. May 1959 From one side of St Brigid s Island the mountains of Connemara can be glimpsed on the distant mainland from the other the Atlantic stretches as far as the eye can see This remote settlement without electricity or even a harbor has scarcely altered since its namesake saint set up a convent of stone huts centuries ago Those who live there including sisters Rose and Emer are hardy and resourceful dependent on the sea and each other for survival Despite the island s natural beauty it is a place that people move away from not tountil an outspoken American also named Brigid arrives to claim her late uncle s cottage Brigid has come for more than an inheritance She s seeking a secret holy well that s rumored to grant miracles Emer as scarred and wary as Rose is friendly and beautiful has good reason to believe in inexplicable powers Despite her own strange abilitiesor perhaps because of themEmer fears that she won t be able to save her young son Niall from a growing threat Yet Brigid has a gift too even more remarkable than Emer s As months pass and Brigid carves out a place on the island and in the sisters lives a complicated web of betrayal fear and desire culminates in one shocking night that will change the island and its inhabitants forever Steeped in Irish history and lore The Stolen Child is a mesmerizing descent into old world beliefs and a captivating exploration of desire myth motherhood and love in all its forms Steeped in dark Irish mythology The Stolen Child is a piercing exploration of regret and desire longing and love It is a gorgeously written inventive and compelling novel Ayelet Waldman Kirk.","year":2017}
{"_id":{"$oid":"5a7e1a0fccb7970ba4f0e06b"},"title":"Wicked","author":"Maguire, Gregory","format":"paperback","fiction":true,"read":true,"pages":406,"genre":"Fantasy","description":"This is the book that started it all! The basis for the smash hit Tony Award-winning Broadway musical, Gregory Maguire's breathtaking New York Times bestseller Wicked views the land of Oz, its inhabitants, its Wizard, and the Emerald City, through a darker and greener (not rosier) lens. Brilliantly inventive, Wicked offers us a radical new evaluation of one of the most feared and hated characters in all of literature: the much maligned Wicked Witch of the West who, as Maguire tells us, wasn’t nearly as Wicked as we imagined.","year":1995}
{"_id":{"$oid":"5a7e1bbbccb7970ba4f0e06c"},"title":"Queen of Palmyra: A Novel, The","author":"Gwin, Minrose","format":"paperback","fiction":true,"read":false,"pages":394,"genre":["Contemporary","Historical","Literary","United States"],"description":"An atmospheric debut novel about growing up in the changing South in 1960s Mississippi in the tradition of Sue Monk Kidd’s The Secret Life of Bees and Kathryn Stockett’s The Help. In the words of Jill McCorkle (Going Away Shoes), “Minrose Gwin is an extremely gifted writer and The Queen of Palmyra is a brilliant and compelling novel.","year":2010}
{"_id":{"$oid":"5a81e535eae2c214dcc00f4a"},"title":"Dragon's Run","author":"Lynn Nye, Jody","format":"paperback","fiction":true,"read":true,"pages":406,"genre":"Fantasy","description":"Griffen already has his hands full running his gambling operation in New Orleans and dealing with his dragon heritage. Now his pregnant sister, Valerie, is missing—possibly kidnapped—and his uncle, Malcolm McCandles, has flown into town for a mysterious meeting with a powerful man who’s been dead for almost eight decades.   And Griffen certainly hasn’t got the time to protect Representative Penny Dunbar, a dragon who’s running for governor of Louisiana—if malign forces don’t take her out first. Griffen learned a long time ago to play the hand fate has dealt him, but with many lives at stake—including Val’s unborn dragon—he’s hoping for an ace in the hole…","year":2013}
{"_id":{"$oid":"5a81e687eae2c214dcc00f4b"},"title":"Ella Enchanted","author":"Levine, Gail Carson","format":"paperback","fiction":true,"read":true,"pages":232,"genre":"Fantasy","description":"At her birth, Ella of Frell receives a foolish fairy's gift—the “gift” of obedience. Ella must obey any order, whether it's to hop on one foot for a day and a half, or to chop off her own head! But strong-willed Ella does not accept her fate...  Against a bold backdrop of princes, ogres, giants, wicked stepsisters, and fairy godmothers, Ella goes on a quest to break the curse forever.","year":1997}
{"_id":{"$oid":"5a81e7f5eae2c214dcc00f4c"},"title":"All the Bright Places","author":"Niven, Jennifer","format":"paperback","fiction":true,"read":false,"pages":378,"genre":"Literary","description":"Theodore Finch is fascinated by death Every day he thinks of ways he might kill himself but every day he also searches for and manages to find something to keep him here and alive and awake Violet Markey lives for the future counting the days until graduation when she can escape her small Indiana town and her aching grief in the wake of her sister s recent death When Finch and Violet meet on the ledge of the bell tower at school six stories above the ground it s unclear who saves whom Soon it s only with Violet that Finch can be himself And it s only with Finch that Violet can forget to count away the days and start living them But as Violet s world grows Finch s begins to shrink A do not miss for fans of Eleanor Park and The Fault in Our Stars and basically anyone who can breathe Justine Magazine At the heart a big one of All the Bright Places lies a charming love story about this unlikely and endearing pair of broken teenagers The New York Times Book Review A heart rending stylish love story The Wall Street Journal A complex love story that will bring all the feels Seventeen Magazine Impressively layered lived in and real Buzzfeed com","year":2015}
{"_id":{"$oid":"5a81eaa3eae2c214dcc00f4d"},"title":"Martian, The","author":"Weir, Andy","format":"paperback","fiction":true,"read":true,"pages":369,"genre":"Science Fiction","description":"Six days ago, astronaut Mark Watney became one of the first people to walk on Mars.  Now, he's sure he'll be the first person to die there.  After a dust storm nearly kills him and forces his crew to evacuate while thinking him dead, Mark finds himself stranded and completely alone with no way to even signal Earth that he’s alive—and even if he could get word out, his supplies would be gone long before a rescue could arrive.  Chances are, though, he won't have time to starve to death. The damaged machinery, unforgiving environment, or plain-old \"human error\" are much more likely to kill him first.  But Mark isn't ready to give up yet. Drawing on his ingenuity, his engineering skills—and a relentless, dogged refusal to quit—he steadfastly confronts one seemingly insurmountable obstacle after the next. Will his resourcefulness be enough to overcome the impossible odds against him?","year":2011}
{"_id":{"$oid":"5a81eb9feae2c214dcc00f4e"},"title":"My Kind of Crazy","author":"Reul, Robin","format":"paperback","fiction":"true","read":"false","pages":"321","genre":"Literary","description":"Hank Kirby can't catch a break. He doesn't mean to screw up. It just happens. Case in point: his attempt to ask out the girl he likes literally goes up in flames when he spelled \"prom\" in sparklers on Amanda Carlisle's lawn...and nearly burns down her house, without ever asking her the big question.  Hank just wants to pretend the incident never happened. And he might've gotten away with it-except there is a witness.  Peyton Breedlove, brooding loner and budding pyromaniac, saw the whole thing, and she blackmails Hank into an unusual friendship. Sure, Hank may be headed for his biggest disaster yet, but it's only when life falls apart that you can start piecing it back together.","year":"2016"}
{"_id":{"$oid":"5a81ed83eae2c214dcc00f4f"},"title":"Dorothy Must Die","author":"Paige, Danielle","format":"paperback","fiction":true,"read":true,"pages":452,"genre":["Fantasy","Science Fiction"],"description":"I didn't ask for any of this. I didn't ask to be some kind of hero. But when your whole life gets swept up by a tornado—taking you with it—you have no choice but to go along, you know?  Sure, I've read the books. I've seen the movies. I know the song about the rainbow and the happy little blue birds. But I never expected Oz to look like this. To be a place where Good Witches can't be trusted, Wicked Witches may just be the good guys, and winged monkeys can be executed for acts of rebellion. There's still a road of yellow brick—but even that's crumbling.  What happened? Dorothy. They say she found a way to come back to Oz. They say she seized power and the power went to her head. And now no one is safe.  My name is Amy Gumm—and I'm the other girl from Kansas. I've been recruited by the Revolutionary Order of the Wicked. I've been trained to fight. And I have a mission: Remove the Tin Woodman's heart. Steal the Scarecrow's brain. Take the Lion's courage. And—Dorothy must die.","year":2014}
{"_id":{"$oid":"5a82ec52f644dc2ea45d2c0f"},"title":"Angel of Darkness, The","author":"Carr, Caleb","format":"paperback","fiction":true,"read":false,"pages":752,"genre":["Historical","Mystery","Thriller"],"year":1997}
{"_id":{"$oid":"5a82ed3ff644dc2ea45d2c10"},"collection":"Dashiell Hammett Complete Novels","title":"Red Harvest","author":"Hammett, Dashiell","fiction":true,"read":true,"pages":187,"genre":["Mystery","Suspense","Thriller"],"year":1929}
{"_id":{"$oid":"5a82ef23f644dc2ea45d2c11"},"collection":"Dashiell Hammett Complete Novels","title":"Dain Curse, The","author":"Hammett, Dashiell","fiction":true,"read":false,"pages":194,"genre":["Mystery","Suspense","Thriller"],"year":1929}
{"_id":{"$oid":"5a82eff3f644dc2ea45d2c12"},"collection":"Dashiell Hammett Complete Novels","title":"Maltese Falcon, The","author":"Hammett, Dashiell","fiction":true,"read":true,"pages":195,"genre":["Mystery","Suspense","Thriller"],"year":1930}
{"_id":{"$oid":"5a82f0b3f644dc2ea45d2c13"},"collection":"Dashiell Hammett Complete Novels","title":"Glass Key, The","author":"Hammett, Dashiell","fiction":true,"read":true,"pages":187,"genre":["Mystery","Suspense","Thriller"],"year":1931}
{"_id":{"$oid":"5a82f117f644dc2ea45d2c15"},"collection":"Dashiell Hammett Complete Novels","title":"Thin Man, The","author":"Hammett, Dashiell","fiction":true,"read":true,"pages":166,"genre":["Mystery","Suspense","Thriller"],"year":1934}
{"_id":{"$oid":"5a8302121ed2873dc0cfb36d"},"title":"Psycho: A Novel","author":"Bloch, Robert","format":"paperback","fiction":true,"read":true,"pages":175,"genre":["Horror","Mystery","Thriller"],"description":"The story was all too real-indeed this classic was inspired by the real-life story of Ed Gein, a psychotic murderer who led a dual life. Alfred Hitchcock too was captivated, and turned the book into one of the most-loved classic films of all time the year after it was released.  Norman Bates loves his Mother. She has been dead for the past twenty years, or so people think. Norman knows better though. He has lived with Mother ever since leaving the hospital in the old house up on the hill above the Bates motel. One night Norman spies on a beautiful woman that checks into the hotel as she undresses. Norman can't help but spy on her. Mother is there though. She is there to protect Norman from his filthy thoughts. She is there to protect him with her butcher knife.","year":1959}
{"_id":{"$oid":"5a8302fd1ed2873dc0cfb36e"},"title":"Go Set a Watchman","author":"Lee, Harper","format":"paperback","fiction":true,"read":false,"pages":280,"genre":"Literary","description":"An historic literary event: the publication of a newly discovered novel, the earliest known work from Harper Lee, the beloved, bestselling author of the Pulitzer Prize-winning classic, To Kill a Mockingbird.Originally written in the mid-1950s, Go Set a Watchman was the novel Harper Lee first submitted to her publishers before To Kill a Mockingbird. Assumed to have been lost, the manuscript was discovered in late 2014.Go Set a Watchman features many of the characters from To Kill a Mockingbird some twenty years later. Returning home to Maycomb to visit her father, Jean Louise Finch?Scout?struggles with issues both personal and political, involving Atticus, society, and the small Alabama town that shaped her.","year":2015}
{"_id":{"$oid":"5a8303e11ed2873dc0cfb36f"},"title":"Exoplanets and Alien Solar Systems","author":"Yaqoob, Tahir","format":"paperbook","fiction":false,"read":false,"pages":201,"subject":["Astronomy","Astrophysics","Space Science"],"description":"here is a quiet revolution going on. An unprecedented number of planets outside of our solar system (exoplanets, or extrasolar planets) have been found, with an explosion in the number of discoveries in recent years. The collective human consciousness has arrived at a place that was inaccessible not long ago. Once upon a time, humanity had not even conceived questions such as, \"Are there planets beyond our solar system?\" or \"Is there intelligent life on other planets?\" Find out what has been happening in this rapidly advancing arena of human exploration, what these extrasolar planets are like, and why some traditional ideas face being thrown out. Get up to speed on the new science with \"Exoplanets and Alien Solar Systems.\" The book is aimed at the layperson, offering translations of astrophysics into plain language, yet it has enough depth in annotated reference notes to the original scientific literature that it will also be useful for those with a greater science background, including teachers and professional scientists. The book will help educators to begin to incorporate the study of extrasolar planets into the curriculum at all academic levels. It is being said by experts in the field that astronomy books will have to be rewritten because of new and unexpected discoveries about the alien worlds. The rewriting has already begun with \"Exoplanets and Alien Solar Systems.\" In particular, the book addresses the problems faced by current planet formation and migration theories head on instead of marginalizing the difficulties, and discusses some new lines of investigation. [Note: the print version of the book has 252 pages.]","year":2011}
{"_id":{"$oid":"5a8306981ed2873dc0cfb370"},"title":"we all looked up","author":"Wallach, Tommy","format":"paperback","fiction":true,"read":false,"pages":370,"genre":"Literary","description":"Four high school seniors put their hopes, hearts, and humanity on the line as an asteroid hurtles toward Earth in Tommy Wallach’s New York Times bestselling “stunning debut” (Kirkus Reviews, starred review).  They always say that high school is the best time of your life.  Peter, the star basketball player at his school, is worried “they” might actually be right. Meanwhile Eliza can’t wait to escape Seattle—and her reputation—and perfect-on-paper Anita wonders if admission to Princeton is worth the price of abandoning her real dreams. Andy, for his part, doesn’t understand all the fuss about college and career—the future can wait.  Or can it? Because it turns out the future is hurtling through space with the potential to wipe out life on Earth. As these four seniors—along with the rest of the planet—wait to see what damage an asteroid will cause, they must abandon all thoughts of the future and decide how they’re going to spend what remains of the present.","year":2015}
{"_id":{"$oid":"5a830bfb1ed2873dc0cfb371"},"title":"Big Sleep, The","author":"Chandler, Raymond","format":"hardcover","fiction":true,"read":true,"pages":219,"genre":["Mystery","Suspense","Thriller"],"description":"A dying millionaire hires private eye Philip Marlowe to handle the blackmailer of one of his two troublesome daughters, and Marlowe finds himself involved with more than extortion. Kidnapping, pornography, seduction, and murder are just a few of the complications he gets caught up in.","year":1939}
{"_id":{"$oid":"5a830cc31ed2873dc0cfb372"},"title":"And then there were None","author":"Christie, Agatha","format":"hardcover","fiction":true,"read":true,"pages":183,"genre":["Mystery","Suspense","Thriller"],"description":"\"Ten . . .\" Ten strangers are lured to an isolated island mansion off the Devon coast by a mysterious \"U. N. Owen.\"  \"Nine . . .\" At dinner a recorded message accuses each of them in turn of having a guilty secret, and by the end of the night one of the guests is dead.  \"Eight . . .\" Stranded by a violent storm, and haunted by a nursery rhyme counting down one by one . . . as one by one . . . they begin to die.  \"Seven . . .\" Which among them is the killer and will any of them survive?","year":1939}
{"_id":{"$oid":"5a830d7b1ed2873dc0cfb373"},"title":"39 Steps, The","author":"Buchan, John","format":"hardcover","fiction":true,"read":false,"pages":120,"genre":["Mystery","Thriller","Suspense"],"description":"Published in 1915 at a time when public interest in espionage and spy adventures was growing, The Thirty-Nine Steps brought the fast-paced adventures of Richard Hannay to an eager audience. Caught up in a geopolitical plot that is transpiring around Europe after two men - one a freelance spy - are murdered in his apartment block, Hannay enters into the murkily adventurous world of espionage in order to save multiple political figures from assassination.  Ahead of its time, The Thirty-Nine Steps pioneered a dialogue rich, fantastical style of writing which would come to typify adventure tales and thrillers. It is frequently placed in the 'man-on-the-run' sub-genre, for portraying Hannay simultaneously as a wanted fugitive, and a potential saviour with important knowledge that may alter the course of Europe's entire politics.  The book gained traction with the public and was a bestseller during and shortly after World War I. Its author penned a further four more works featuring Richard Hannay, while The Thirty-Nine Steps itself has received several motion picture and radio adaptations.","year":1915}
{"_id":{"$oid":"5a830e751ed2873dc0cfb374"},"title":"Journey into Fear","author":"Ambler, Eric","format":"hardcover","fiction":true,"read":false,"pages":184,"genre":["Mystery","Thriller","Suspense"],"description":"Returning to his hotel room after a late-night flirtation with a cabaret dancer at an Istanbul boîte, Graham is surprised by an intruder with a gun. What follows is a nightmare of intrigue for the English armaments engineer as he makes his way home aboard an Italian freighter. Among the passengers are a couple of Nazi assassins intent on preventing his returning to England with plans for a Turkish defense system, the seductive cabaret dancer and her manager husband, and a number of surprising allies.","year":1940}
{"_id":{"$oid":"5a85acca55f48139c4c28d05"},"title":"Stranger in the Moonlight","author":"Deveraux, Jude","format":"paperback","fiction":true,"read":false,"pages":362,"genre":["Fantasy","Romance"],"description":"Kim Aldredge is delighted that her dear college “sister” Jecca has found lasting love with Kim’s cousin Tristan. But despite her flourishing jewelry-making career, Kim’s own happiness seems as distant as the childhood summer when she played the hours away with young Travis Merritt, who came to Edilean with his mother under mysterious circumstances. At the end of that innocent season, he promised Kim he would return one day . . . and then vanished without even a goodbye. Years later, a worn photo is Kim’s only proof of the perfect joy they shared. But when she least expects it, Travis, now a savvy Manhattan attorney, will crash into her life once more. Will Kim see the boy she knew under the man he’s become?","year":2012}
{"_id":{"$oid":"5a85af2f55f48139c4c28d06"},"title":"Warlock Enlarged, The","author":"Stasheff, Christopher","format":"hardcover","fiction":true,"read":true,"pages":664,"genre":["Action","Adventure","Fantasy","Science Fiction"],"description":"AT first glance, the planet was unremarkable. Its five continents and numerous small islands were covered with rain forest and inhabited by amphibians and hordes of insects - very much like Terra during its Carboniferous Era. One large island was noticeably different, however. It had been terraformed by human colonists centuries earlier . . . colonists who had abandoned technology in order to recreate the medieval / renaissance culture of Old Earth, right down to the belief in magic and witches. And on Gramarye, those beliefs were not merely archaic superstitions; they were facts of life. Rod Gallowglass, agent for the Society for the Conversion of Extraterrestrial Nascent Totalitarianisms (SCENT, for short), had sniffed out the Lost Colony - and been amazed to discover it was a communications gold mine: a segment of the population were genuine espers. No matter that, in this particular anachronistic setting, they were known as witches and warlocks: they were telepaths, and with their ability to communicate instantaneously, regardless of distance, they would be invaluable to the Decentralized Democratic Tribunal which had created SCENT. It was Rod's job to steer them gently in the right direction . . . to see that Gramarye's monarchy gradually evolved along democratic lines. And, aided by an old family retainer named Fess - an antique robot whose brain he had placed in a black steel horse's body - the agent was doing quite well. He had earned the Crown's respect and, in recognition of his \"powers,\" been awarded the title \"High Warlock.\" He had also married a beautiful, gifted witch - strange as it was to raise children who were capable of levitation and telekinesis, among other adorable tricks. But if Gramarye had strategic value for the DDT, it was equally important to the opponents of democracy. With all of technology at their command - resources unknown on Gramarye - and no scruples about using it, Rod's enemies had a powerful advantage.","year":1980}
{"_id":{"$oid":"5a85b0bf55f48139c4c28d07"},"title":"Undead and Unstable","author":"Davidson, Mary Janice","format":"hardcover","fiction":true,"read":false,"pages":312,"genre":["Fantasy","Humor","Magical Realism"],"description":"Betsy’s heartbroken over her friend Marc’s death, but at least his sacrifice should change the future—her future­—for the better. But Betsy’s next few hundred years will still be far from perfect. After all, her half sister Laura is the Antichrist and Laura’s mother is Satan, which means that family gatherings will always be more than a little awkward.   What’s really bothering Betsy is that ever since she and Laura returned from visiting their mom in hell, Laura’s been acting increasingly peculiar. Maybe it’s Laura’s new job offer as Satan’s replacement down under. Unfortunately, the position comes at a damnable price: her soul. Now a war has been waged—one that’s going to take sibling rivalry to a whole new level and a dimension where only one sister can survive.","year":2012}
{"_id":{"$oid":"5a85b1ee55f48139c4c28d08"},"title":"Distraction Addiction, The","author":"Soojung-Kim Pang, Alex","format":"hardcover","fiction":false,"read":true,"pages":280,"subject":["Computers","Human-Computer Interaction","Technology"],"description":"The question of our time: can we reclaim our lives in an age that feels busier and more distracting by the day?  We've all found ourselves checking email at the dinner table, holding our breath while waiting for Outlook to load, or sitting hunched in front of a screen for an hour longer than we intended.  Mobile devices and the web have invaded our lives, and this is a big idea book that addresses one of the biggest questions of our age: can we stay connected without diminishing our intelligence, attention spans, and ability to really live? Can we have it all?  Alex Soojung-Kim Pang, a renowned Stanford technology guru, says yes. THE DISTRACTION ADDICTION is packed with fascinating studies, compelling research, and crucial takeaways. Whether it's breathing while Facebook refreshes, or finding creative ways to take a few hours away from the digital crush, this book is about the ways to tune in without tuning out.","year":2013}
{"_id":{"$oid":"5a85c77755f48139c4c28d09"},"title":"Interstellar","author":"Keyes, Greg","format":"paperback","fiction":true,"read":true,"pages":278,"genre":"Science Fiction","description":"From acclaimed filmmaker Christopher Nolan (The Dark Knight Triology, Inception), this is the chronicle of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage. At stake are the fate of a planet… Earth… and the future of the human race. ","year":2014}
{"_id":{"$oid":"5a87d66579b6924f6ca0c3f5"},"title":"Inkheart","author":"Funke, Cornelia","format":"paperback","fiction":true,"read":true,"pages":563,"genre":"Fantasy","description":"One cruel night, Meggie's father reads aloud from Inkheart, and an evil ruler named Capricorn escapes the boundaries of the book, landing in their liing room. Suddenly Meggie's in the middle of the kind of adventure she thought only took place in fairy tales. Somehow, she must master the magic that has conjured up this mightmare. Can she change the course of the story that has changed her life forever?","year":2003}
{"_id":{"$oid":"5a87d7f079b6924f6ca0c3f6"},"title":"Writing \u0026 Selling Short Stories \u0026 Personal Essays","author":"Harris, Windy Lynn","format":"paperback","fiction":false,"read":true,"pages":241,"subject":"Writing","description":"hort stories and personal essays have never been hotter--or more crucial for a successful writing career. Earning bylines in magazines and literary journals is a terrific way to get noticed and earn future opportunities in both short- and long-form writing.  Writing \u0026 Selling Short Stories \u0026 Personal Essays capitalizes on the popularity of these genres by instructing on the two key steps to publishing short works: crafting excellent pieces and successfully submitting them.","year":2017}
{"_id":{"$oid":"5a87d98479b6924f6ca0c3f7"},"title":"First Blood","author":"Morrell, David","format":"paperback","fiction":true,"read":false,"pages":284,"genre":["Ghosts","Horror","War"],"description":"First came the man: a young wanderer in a fatigue coat and long hair. Then came the legend, as John Rambo sprang from the pages of FIRST BLOOD to take his place in the American cultural landscape. This remarkable novel pits a young Vietnam veteran against a small-town cop who doesn't know whom he's dealing with -- or how far Rambo will take him into a life-and-death struggle through the woods, hills, and caves of rural Kentucky.  Millions saw the Rambo movies, but those who haven't read the book that started it all are in for a surprise -- a critically acclaimed story of character, action, and compassion.","year":1972}
